; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	thermograph2 - mode
	thermograph1 - mode
	infrared0 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star0 - direction
	Star5 - direction
	GroundStation4 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star5)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
)
(:goal (and
	(have_image Phenomenon6 thermograph2)
	(have_image Star7 thermograph1)
	(have_image Star8 infrared0)
	(have_image Phenomenon9 thermograph1)
	(have_image Planet10 thermograph2)
	(have_image Phenomenon11 infrared0)
	(have_image Planet12 thermograph2)
	(have_image Phenomenon13 thermograph1)
))

)

; plan
1. (turn_to satellite1 groundstation4 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 8
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 8
3. (calibrate satellite1 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 0 of 8
4. (turn_to satellite1 phenomenon9 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 8
5. (take_image satellite1 phenomenon9 instrument2 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 1 of 8
6. (turn_to satellite1 phenomenon6 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 8
7. (take_image satellite1 phenomenon6 instrument2 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   goals met: 2 of 8
8. (turn_to satellite1 phenomenon13 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 8
9. (take_image satellite1 phenomenon13 instrument2 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 3 of 8
10. (turn_to satellite1 phenomenon11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon11)
   goals met: 3 of 8
11. (take_image satellite1 phenomenon11 instrument2 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 4 of 8
12. (turn_to satellite1 planet10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet10)
   goals met: 4 of 8
13. (take_image satellite1 planet10 instrument2 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 5 of 8
14. (turn_to satellite1 planet12 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet12)
   goals met: 5 of 8
15. (take_image satellite1 planet12 instrument2 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 6 of 8
16. (turn_to satellite1 star7 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star7)
   goals met: 6 of 8
17. (take_image satellite1 star7 instrument2 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 7 of 8
18. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 7 of 8
19. (take_image satellite1 star8 instrument2 infrared0)
   added: (have_image star8 infrared0)
   goals met: 8 of 8
